import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'アオイクレアトール', '牡5', 56.0, '内田博幸', 8, 35.8, '500(-2)', '[東] 古賀慎明', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([2, 2, 'ワールドバローズ', '牡4', 56.0, '和田竜二', 6, 29.1, '480(+6)', '[西] 石坂公一', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([2, 3, 'ディアンドル', '牝6', 56.0, '石川裕紀', 15, 121.2, '488(0)', '[西] 奥村豊', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([3, 4, 'マルターズディオサ', '牝5', 56.0, '松岡正海', 9, 41.5, '352(-2)', '[東] 手塚貴久', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([3, 5, 'トーラスジェミニ', '牡6', 58.0, '横山武史', 14, 84.2, '502(0)', '[東] 小桧山悟', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([4, 6, 'ファインルージュ', '牝4', 55.0, 'ルメール', 1, 2.4, '480(+10)', '[東] 木村哲也', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([4, 7, 'ケイデンスコール', '牡6', 59.0, '石橋脩', 10, 55.0, '478(0)', '[西] 安田隆行', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([5, 8, 'ドナアトラエンテ', '牝6', 54.0, 'Ｍデムー', 7, 31.9, '512(+6)', '[東] 国枝栄', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([5, 9, 'カラテ', '牡6', 57.0, '菅原明良', 2, 3.6, '498(+4)', '[東] 高橋祥泰', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([6, 10, 'エイシンチラー', '牝4', 54.0, '柴田大知', 13, 73.5, '516(+2)', '[東] 田中剛', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([6, 11, 'イルーシヴパンサー', '牡4', 56.0, '田辺裕信', 4, 6.7, '474(-6)', '[東] 久保田貴', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([7, 12, 'ヴェロックス', '牡6', 57.0, '三浦皇成', 12, 73.0, '476(-2)', '[西] 中内田充', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([7, 13, 'ホウオウアマゾン', '牡4', 57.0, '坂井瑠星', 3, 4.1, '516(+2)', '[西] 矢作芳人', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([8, 14, 'カテドラル', '牡6', 58.0, '戸崎圭太', 5, 13.9, '496(+4)', '[西] 池添学', '芝左1600m', '曇', '良', 'G3'])
    horse_list.append([8, 15, 'カレンシュトラウス', '牡5', 56.0, '津村明秀', 11, 69.7, '516(+4)', '[西] 平田修', '芝左1600m', '曇', '良', 'G3'])
    # horse_list.append([8, 16, 'エアアルマス', '牡7', 57.0, 'ルメール', 11, 8.8, '476(+12)', '[西] 池添学', 'ダ左1400m', '曇', '良', 'G3'])
    # horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    # horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態', 'レース種類']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()