import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'ペルシアンナイト', '牡7', 57.0, 'Ｃデムー', 11, 46.0, '500(-2)', '[西] 池江泰寿', '芝右2500', '晴', '良'])
    horse_list.append([1, 2, 'パンサラッサ', '牡4', 57.0, '菱田裕二', 9, 27.8, '480(+6)', '[西] 矢作芳人', '芝右2500', '晴', '良'])
    horse_list.append([2, 3, 'モズベッロ', '牡5', 57.0, '池添謙一', 14, 72.1, '488(0)', '[西] 森田直行', '芝右2500', '晴', '良'])
    horse_list.append([2, 4, 'メロディーレーン', '牝5', 55.0, '岩田望来', 13, 68.3, '352(-2)', '[西] 森田直行', '芝右2500', '晴', '良'])
    horse_list.append([3, 5, 'ディープボンド', '牡4', 57.0, '和田竜二', 5, 18.3, '502(0)', '[西] 大久保龍', '芝右2500', '晴', '良'])
    horse_list.append([3, 6, 'ウインキートス', '牝4', 55.0, '丹内祐次', 12, 49.0, '480(+10)', '[東] 宗像義忠', '芝右2500', '晴', '良'])
    horse_list.append([4, 7, 'クロノジェネシス', '牝5', 55.0, 'ルメール', 2, 4.0, '478(0)', '[西] 斉藤崇史', '芝右2500', '晴', '良'])
    horse_list.append([4, 8, 'ユーキャンスマイル', '牡6', 57.0, '藤岡佑介', 16, 87.7, '512(+6)', '[西] 友道康夫', '芝右2500', '晴', '良'])
    horse_list.append([5, 9, 'ステラヴェローチェ', '牡3', 55.0, 'Ｍデムー', 3, 4.5, '498(+4)', '[西] 須貝尚介', '芝右2500', '晴', '良'])
    horse_list.append([5, 10, 'エフフォーリア', '牡3', 55.0, '横山武史', 1, 2.9, '516(+2)', '[東] 鹿戸雄一', '芝右2500', '晴', '良'])
    horse_list.append([6, 11, 'アリストテレス', '牡4', 57.0, '武豊', 7, 25.0, '474(-6)', '[西] 音無秀孝', '芝右2500', '晴', '良'])
    horse_list.append([6, 12, 'シャドウディーヴァ', '牝5', 55.0, '横山典弘', 15, 77.3, '476(-2)', '[東] 斎藤誠', '芝右2500', '晴', '良'])
    horse_list.append([7, 13, 'アカイイト', '牝4', 55.0, '幸英明', 6, 19.0, '516(+2)', '[西] 中竹和也', '芝右2500', '晴', '良'])
    horse_list.append([7, 14, 'アサマノイタズラ', '牡3', 55.0, '田辺裕信', 10, 31.6, '496(+4)', '[東] 手塚貴久', '芝右2500', '晴', '良'])
    horse_list.append([8, 15, 'キセキ', '牡7', 57.0, '松山弘平', 8, 27.3, '516(+4)', '[西] 辻野泰之', '芝右2500', '晴', '良'])
    horse_list.append([8, 16, 'タイトルホルダー', '牡3', 55.0, '横山和生', 4, 9.9, '476(+12)', '[東] 栗田徹', '芝右1600', '晴', '良'])
    # horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    # horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()