import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'モズナガレボシ', '牡5', 57.0, '松山弘平', 6, 38.5, '500(-2)', '[西] 荒川義之', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([1, 2, 'クラヴェル', '牝5', 57.0, '横山典弘', 4, 6.3, '480(+6)', '[西] 安田翔伍', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([2, 3, 'マイネルウィルトス', '牡6', 57.0, '川須栄彦', 8, 39.4, '488(0)', '[西] 宮徹', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([2, 4, 'ステラヴェローチェ', '牡4', 55.0, 'Ｍデムー', 1, 1.5, '352(-2)', '[西] 須貝尚介', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([3, 5, 'ロードマイウェイ', '牡6', 57.0, '幸英明', 13, 175.3, '502(0)', '[西] 杉山晴紀', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([3, 6, 'ヤシャマル', '牡5', 55.0, '松田大作', 10, 86.0, '480(+10)', '[東] 尾形和幸', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([4, 7, 'アフリカンゴールド', 'セ7', 55.0, '国分恭介', 9, 71.5, '478(0)', '[西] 西園正都', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([4, 8, 'フライライクバード', '牡5', 57.0, '武豊', 3, 6.1, '512(+6)', '[西] 友道康夫', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([5, 9, 'マイネルフラップ', '牡6', 55.0, '国分優作', 15, 226.8, '498(+4)', '[西] 梅田智之', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([5, 10, 'ヨーホーレイク', '牡4', 55.0, '川田将雅', 2, 5.4, '516(+2)', '[西] 友道康夫', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([6, 11, 'ショウナンバルディ', '牡6', 57.0, '坂井瑠星', 5, 22.4, '474(-6)', '[西] 松下武士', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([6, 12, 'エフェクトオン', '牡6', 55.0, '秋山真一', 12, 142.9, '476(-2)', '[東] 久保田貴', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([7, 13, 'トップウイナー', '牡6', 55.0, '和田翼', 16, 311.9, '516(+2)', '[西] 鈴木孝志', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([7, 14, 'プレシャスブルー', '牡8', 55.0, '勝浦正樹', 14, 184.3, '496(+4)', '[東] 相沢郁', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([8, 15, 'ダノンマジェスティ', '牡7', 57.0, '岩田望来', 7, 39.1, '516(+4)', '[西] 音無秀孝', '芝左2200', '晴', '良', 'G2'])
    horse_list.append([8, 16, 'トラストケンシン', '牡7', 55.0, '池添謙一', 11, 109.0, '476(+12)', '[東] 高橋文雅', '芝左2200', '晴', '良', 'G2'])
    # horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    # horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態', 'レース種類']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()