import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([5, 10, 'サークルオブライフ', '牝2', 54.0, 'Ｍデムー', 3, 5.6, '478(0)', '[東] 国枝栄', '芝右1600', '晴', '良'])
    horse_list.append([6, 11, 'ラブリイユアアイズ', '牝2', 54.0, '団野大成', 8, 51.2, '428(-10)', '[東] 黒岩陽一', '芝右1600', '晴', '良'])
    horse_list.append([7, 13, 'ウォーターナビレラ', '牝2', 54.0, '武豊', 4, 6.6, '470(-2)', '[西] 武幸四郎', '芝右1600', '晴', '良'])
    horse_list.append([8, 17, 'ナミュール', '牝2', 54.0, 'Ｃデムー', 1, 2.9, '430(-10)', '[西] 高野友和', '芝右1600', '晴', '良'])
    horse_list.append([1, 1, 'ナムラクレア', '牝2', 54.0, '浜中俊', 6, 11.9, '454(-6)', '[西] 長谷川浩', '芝右1600', '晴', '良'])
    horse_list.append([8, 16, 'ベルクレスタ', '牝2', 54.0, '松山弘平', 5, 8.3, '466(-2)', '[西] 須貝尚介', '芝右1600', '晴', '良'])
    horse_list.append([4, 8, 'ステルナティーア', '牝2', 54.0, 'ルメール', 2, 4.9, '432(-10)', '[東] 木村哲也', '芝右1600', '晴', '良'])
    horse_list.append([3, 5, 'スタティスティクス', '牝2', 54.0, '和田竜二', 9, 76.3, '434(-4)', '[西] 石坂公一', '芝右1600', '晴', '良'])
    horse_list.append([6, 12, 'アネゴハダ', '牝2', 54.0, '幸英明', 11, 97.6, '442(+2)', '[西] 佐々木晶', '芝右1600', '晴', '良'])
    horse_list.append([4, 7, 'キミワクイーン', '牝2', 54.0, '内田博幸', 10, 80.9, '420(+2)', '[東] 奥村武', '芝右1600', '晴', '良'])
    horse_list.append([7, 14, 'サク', '牝2', 54.0, '酒井学', 15, 145.6, '448(+2)', '[西] 北出成人', '芝右1600', '晴', '良'])
    horse_list.append([5, 9, 'シークルーズ', '牝2', 54.0, '岩田望来', 14, 141.8, '428(+8)', '[西] 杉山晴紀', '芝右1600', '晴', '良'])
    horse_list.append([2, 4, 'トーホウラビアン', '牝2', 54.0, '太宰啓介', 18, 325.9, '416(-10)', '[西] 川村禎彦', '芝右1600', '晴', '良'])
    horse_list.append([7, 15, 'ダークペイジ', '牝2', 54.0, '横山和生', 12, 104.4, '452(+4)', '[西] 吉村圭司', '芝右1600', '晴', '良'])
    horse_list.append([3, 6, 'タナザウィング', '牝2', 54.0, '国分恭介', 16, 175.6, '452(-4)', '[西] 清水久詞', '芝右1600', '晴', '良'])
    horse_list.append([8, 18, 'パーソナルハイ', '牝2', 54.0, '藤岡康太', 7, 41.7, '462(-8)', '[西] 矢作芳人', '芝右1600', '晴', '良'])
    horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()