import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'キングオブコージ', '牡6', 56.0, '横山典弘', 3, 7.3, '500(-2)', '[西] 安田翔伍', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([2, 2, 'アサマノイタズラ', '牝4', 56.0, '嶋田純次', 4, 12.8, '480(+6)', '[東] 手塚貴久', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([3, 3, 'キャッスルトップ', '牡4', 57.0, '仲野光馬', 13, 88.3, '488(0)', '[地] 渋谷信博', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([3, 4, 'クレッシェンドラヴ', '牡8', 56.0, '津村明秀', 12, 76.8, '352(-2)', '[東] 林徹', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([4, 5, 'エヒト', '牡5', 56.0, '北村宏司', 9, 44.9, '502(0)', '[西] 森秀行', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([4, 6, 'ポタジェ', '牡5', 56.0, '川田将雅', 2, 2.8, '480(+10)', '[西] 友道康夫', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([5, 7, 'ダンビュライト', 'セ8', 56.0, '松若風馬', 11, 54.0, '478(0)', '[西] 音無秀孝', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([5, 8, 'アンティシペイト', '牡5', 56.0, '大野拓弥', 8, 33.1, '512(+6)', '[東] 国枝栄', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([6, 9, 'ボッケリーニ', '牡6', 56.0, '横山武史', 5, 14.4, '498(+4)', '[西] 池江泰寿', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([6, 10, 'ラストドラフト', '牡6', 56.0, '戸崎圭太', 6, 21.2, '516(+2)', '[東] 戸田博文', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([7, 11, 'オーソクレース', '牡4', 55.0, 'Ｃルメー', 1, 2.5, '474(-6)', '[東] 久保田貴', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([7, 12, 'ソッサスブレイ', 'セ8', 56.0, '柴田大知', 14, 105.2, '476(-2)', '[東] 粕谷昌央', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([8, 13, 'スマイル', '牡6', 56.0, '田辺裕信', 7, 21.3, '516(+2)', '[東] 堀宣行', '芝右2200', '晴', '良', 'G2'])
    horse_list.append([8, 14, 'マイネルファンロン', '牡7', 56.0, '松岡正海', 10, 50.5, '496(+4)', '[東] 手塚貴久', '芝右2200', '晴', '良', 'G2'])
    # horse_list.append([8, 15, 'ダノンマジェスティ', '牡7', 57.0, '岩田望来', 7, 39.1, '516(+4)', '[西] 音無秀孝', '芝左2200', '晴', '良', 'G2'])
    # horse_list.append([8, 16, 'トラストケンシン', '牡7', 55.0, '池添謙一', 11, 109.0, '476(+12)', '[東] 高橋文雅', '芝左2200', '晴', '良', 'G2'])
    # horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    # horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態', 'レース種類']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()
