import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'ソッサスブレイ', 'セ8', 56.0, '柴田大知', 16, 134.6, '502(0)', '[東] 粕谷昌央', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([1, 2, 'トーラスジェミニ', '牡6', 56.0, '西村淳也', 10, 45.5, '502(0)', '[東] 小桧山悟', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([2, 3, 'ガロアクリーク', '牡5', 56.0, '田辺裕信', 8, 19.3, '502(0)', '[東] 上原博之', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([2, 4, 'ヒュミドール', 'セ6', 56.0, 'Ｍデムー', 5, 14.4, '502(0)', '[東] 小手川準', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([3, 5, 'パンサラッサ', '牡5', 56.0, '吉田豊', 2, 4.3, '502(0)', '[西] 矢作芳人', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([3, 6, 'レッドサイオン', 'セ6', 56.0, '木幡育也', 11, 61.6, '502(0)', '[東] 藤沢和雄', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([4, 7, 'ウインイクシード', '牡8', 56.0, '松岡正海', 7, 18.0, '502(0)', '[東] 鈴木伸尋', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([4, 8, 'マルターズディオサ', '牝5', 54.0, '戸崎圭太', 9, 28.9, '502(0)', '[東] 手塚貴久', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([5, 9, 'ゴーフォザサミット', 'セ7', 56.0, '北村宏司', 12, 63.3, '502(0)', '[東] 藤沢和雄', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([5, 10, 'ルフトシュトローム', '牡5', 56.0, '石橋脩', 15, 116.0, '502(0)', '[東] 堀宣行', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([6, 11, 'カラテ', '牡6', 56.0, '菅原明良', 4, 7.6, '502(0)', '[東] 高橋祥泰', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([6, 12, 'アドマイヤハダル', '牡4', 55.0, '横山武史', 3, 5.2, '502(0)', '[西] 大久保龍', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([7, 13, 'ワールドリバイバル', '牡4', 55.0, '津村明秀', 14, 96.9, '502(0)', '[西] 牧田和弥', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([7, 14, 'コントラチェック', '牝6', 54.0, '丸山元気', 6, 14.8, '502(0)', '[東] 藤沢和雄', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([8, 15, 'ダノンザキッド', '牡4', 55.0, '川田将雅', 1, 3.0, '502(0)', '[西] 安田隆行', '芝右1800m', '晴', '良', 'G2'])
    horse_list.append([8, 16, 'ワールドウインズ', 'セ5', 56.0, '田中勝春', 13, 88.6, '502(0)', '[西] 武幸四郎', '芝右1800m', '晴', '良', 'G2'])


    columns = ['frame_num', 'horse_num', 'horse_name', 'sex_age', 'weight_to_carry', 'jockey', 'popular', 'win',
               'horse_weight', 'trainer', 'race_name', 'weather', 'race_cond', 'race_type']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()