import pandas as pd


def create_csv():
    result_dir = './result/'  # 結果を出力するディレクトリ名

    horse_list = []
    horse_list.append([1, 1, 'オーロラテソーロ', '牡5', 56.0, '秋山真一', 6, 117.7, '500(-2)', '[東] 畠山吉宏', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([1, 2, 'レピアーウィット', '牡7', 57.0, '大野拓弥', 4, 167.3, '480(+6)', '[東] 堀宣行', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([2, 3, 'モジアナフレイバー', '牡7', 56.0, '真島大輔', 8, 51.7, '488(0)', '[地] 福永敏', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([2, 4, 'スリーグランド', '牡5', 56.0, '岩田望来', 1, 22.5, '352(-2)', '[西] 高橋義忠', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([3, 5, 'オメガレインボー', '牡6', 56.0, '横山和生', 13, 3.1, '502(0)', '[西] 安田翔伍', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([3, 6, 'ジャスティン', '牡6', 57.0, '坂井瑠星', 10, 64.2, '480(+10)', '[西] 矢作芳人', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([4, 7, 'ヘリオス', 'セ6', 56.0, '武豊', 9, 5.5, '478(0)', '[西] 寺島良', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([4, 8, 'タガノビューティー', '牡5', 56.0, '津村明秀', 3, 4.5, '512(+6)', '[西] 西園正都', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([5, 9, 'ソリストサンダー', '牡7', 57.0, '戸崎圭太', 15, 2.9, '498(+4)', '[西] 高柳大輔', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([5, 10, 'リアンヴェリテ', '牡8', 56.0, '国分恭介', 2, 221.3, '516(+2)', '[西] 中竹和也', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([6, 11, 'テイエムサウスダン', '牡5', 57.0, '岩田康誠', 5, 22.2, '474(-6)', '[西] 飯田雄三', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([6, 12, 'タイムフライヤー', '牡7', 56.0, 'Ｍデムー', 12, 15.4, '476(-2)', '[西] 橋口慎介', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([7, 13, 'サクセスエナジー', '牡8', 58.0, '石川裕紀', 16, 113.7, '516(+2)', '[西] 北出成人', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([7, 14, 'トップウイナー', '牡6', 56.0, '横山琉人', 14, 297.5, '496(+4)', '[西] 鈴木孝志', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([8, 15, 'ジャスパープリンス', '牡7', 56.0, '川田将雅', 7, 42.2, '516(+4)', '[西] 森秀行', 'ダ左1400', '晴', '良', 'G3'])
    horse_list.append([8, 16, 'エアアルマス', '牡7', 57.0, 'ルメール', 11, 27.7, '476(+12)', '[西] 池添学', 'ダ左1400', '晴', '良', 'G3'])
    # horse_list.append([1, 2, 'ナムラリコリス', '牝2', 54.0, '泉谷楓真', 13, 111.3, '476(+12)', '[西] 大橋勇樹', '芝右1600', '晴', '良'])
    # horse_list.append([2, 3, 'ヒノクニ', '牝2', 54.0, '長岡禎仁', 17, 261.2, '446(+8)', '[東] 深山雅史', '芝右1600', '晴', '良'])

    columns = ['枠番', '馬番', '馬名', '性齢', '斤量', '騎手', '人気', '単勝', '馬体重', '調教師', 'レース名', '天候', '芝状態', 'レース種類']
    df = pd.DataFrame(horse_list, columns=columns)

    print(df)

    # CSVファイルとして出力
    df.to_csv(f'{result_dir}test.csv', index=False)


if __name__ == '__main__':
    create_csv()